Tekla Open API Reference for Tekla Structures 2025
PropertyElement Constructor
 Creates a new property element instance with the given property element type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PropertyElement(
	PropertyElement.PropertyElementType PropertyType
)
Public Sub New (
	PropertyType As PropertyElement.PropertyElementType
)
Parameters
PropertyType
Type: Tekla.Structures.Drawing.PropertyElement.PropertyElementType
The property element type to be used.
See Also
Reference
PropertyElement Class
Tekla.Structures.Drawing Namespace